; domain
(define (domain clean_home)
  (:requirements :strips :typing)

  (:types
    item room rug basket surface cleaner dish)

  (:predicates
    ;;
    (stray_item ?item - item)
    (in_basket ?item - item ?basket - basket)

    ;;
    (cleaned_room ?room - room)
    (cleaned_rug ?rug - rug)
    (cleaned_surface ?surface - surface)
    (empty ?basket - basket)
    (full ?basket - basket)
    (trash_disposed ?dish - dish)
    (organized ?item - item)

    ;;
    (dusty ?room - room)
    (dirty_rug ?rug - rug)
    (dirty_surface ?surface - surface)
  )

  ;;   1：
  (:action pickup_items
    :parameters (?item - item ?basket - basket)
    :precondition (and
                    (stray_item ?item)
                    (empty ?basket))
    :effect (and
              (in_basket ?item ?basket)
              (organized ?item)
              (full ?basket))
  )

  ;;   2：
  (:action dust_room
    :parameters (?room - room)
    :precondition (dusty ?room)
    :effect (and
              (cleaned_room ?room)
              (not (dusty ?room)))
  )

  ;;   3：
  (:action empty_trash
    :parameters (?basket - basket ?dish - dish)
    :precondition (full ?basket)
    :effect (and
              (empty ?basket)
              (trash_disposed ?dish))
  )

  ;;   4：
  (:action clean_surfaces
    :parameters (?surface - surface ?cleaner - cleaner)
    :precondition (dirty_surface ?surface)
    :effect (cleaned_surface ?surface)
  )

  ;;   5：
  (:action shake_rugs
    :parameters (?rug - rug)
    :precondition (dirty_rug ?rug)
    :effect (cleaned_rug ?rug)
  )

  ;;   6：
  (:action enjoy_clean_home
    :parameters ()
    :precondition ()
    :effect ()
  )
)

; problem
(define (problem clean_home_problem)
  (:domain clean_home)

  (:objects
    ;;
    living_room kitchen bathroom - room

    ;;
    rug1 rug2 - rug

    ;;
    basket1 basket2 - basket

    ;;
    item1 item2 - item

    ;;
    TV window1 window2 - surface

    ;;
    cleaner1 - cleaner

    ;;
    trash_bag1 trash_bag2 - dish
  )

  (:init
    ;;
    (stray_item item1)
    (stray_item item2)

    (empty basket1)
    (empty basket2)

    (dusty living_room)
    (dusty kitchen)
    (dusty bathroom)

    (dirty_rug rug1)
    (dirty_rug rug2)

    (dirty_surface TV)
    (dirty_surface window1)
    (dirty_surface window2)

    ;;
    (empty trash_bag1)
    (empty trash_bag2)
  )

  (:goal
    (and
      ;;
      (cleaned_room living_room)
      (cleaned_room kitchen)
      (cleaned_room bathroom)

      ;;
      (cleaned_rug rug1)
      (cleaned_rug rug2)

      ;;
      (cleaned_surface TV)
      (cleaned_surface window1)
      (cleaned_surface window2)

      ;;
      (trash_disposed trash_bag1)
      (trash_disposed trash_bag2)

      ;;
      (organized item1)
      (organized item2)
    )
  )
)

; plan
1. (pickup_items item1 basket1)
   added: (in_basket item1 basket1) (organized item1) (full basket1)
   goals met: 1 of 12
2. (clean_surfaces tv cleaner1)
   added: (cleaned_surface tv)
   goals met: 2 of 12
3. (clean_surfaces window1 cleaner1)
   added: (cleaned_surface window1)
   goals met: 3 of 12
4. (clean_surfaces window2 cleaner1)
   added: (cleaned_surface window2)
   goals met: 4 of 12
5. (pickup_items item2 basket1)
   added: (in_basket item2 basket1) (organized item2)
   goals met: 5 of 12
6. (shake_rugs rug1)
   added: (cleaned_rug rug1)
   goals met: 6 of 12
7. (shake_rugs rug2)
   added: (cleaned_rug rug2)
   goals met: 7 of 12
8. (empty_trash basket1 trash_bag1)
   added: (trash_disposed trash_bag1)
   goals met: 8 of 12
9. (empty_trash basket1 trash_bag2)
   added: (trash_disposed trash_bag2)
   goals met: 9 of 12
10. (dust_room living_room)
   deleted: (dusty living_room)
   added: (cleaned_room living_room)
   goals met: 10 of 12
11. (dust_room kitchen)
   deleted: (dusty kitchen)
   added: (cleaned_room kitchen)
   goals met: 11 of 12
12. (dust_room bathroom)
   deleted: (dusty bathroom)
   added: (cleaned_room bathroom)
   goals met: 12 of 12
